{
    "news_list": [
      {
        "date": "Oct. 2025",
        "news": "Our paper preprint <strong>Audio-Maestro<strong> & <strong>Adaptive Vector Steering<strong> is released! Thanks the great help from ASUS and Professor. HungYi Lee!"
      },
      {
        "date": "Sep. 2025",
        "news": "Our paper preprint <strong>AEGIS<strong> is released!"
      },
      {
        "date": "Aug. 2025",
        "news": "We successfully completed the<strong>NTU Continuing Education Workshop on AI Agents & Multimodal Models<strong>! Thanks to the 340 professionals and students for participating!"
      },
      {
        "date": "Apr. 2025",
        "news": "Our paper preprint <strong>TASTE<strong> is released! Thanks the great help from MediaTek Research and Professor. HungYi Lee!"
      },
      {
        "date": "Feb. 2025",
        "news": "We won the Third Place in 2025 Interspeech SUPERB Challenge!"
      },
      {
        "date": "Feb. 2025",
        "news": "Our paper was accepted by <strong>Journal of Microbiology, Immunology and Infection</strong> and published in Volume 58, Issue 1!"
      }
      

    ],
    "paper_list": [
      {
        "title": "Audio-Maestro: Enhancing Large Audio-Language Models with Tool-Augmented Reasoning",
        "image": "images/Audio-maestro.png",
        "authors": "<strong> Kuan-Yi Lee </strong>, Tsun-En, Lin, Hung-yi Lee",
        "conference": "arxiv preprint",
        "paper_link": "https://arxiv.org/abs/2510.11454",
        "code_link": "",
        "page_link": "",
        "abstract": "Enhancing large audio-language models with tool-augmented reasoning, achieving up to 5% absolute improvement on MMAU."
      },
      {
        "title": "TASTE: Text-Aligned Speech Tokenization and Embedding for Spoken Language Modeling",
        "image": "images/Taslm.png",
        "authors": "Liang-Hsuan Tseng*, Yi-Chang Chen*, <strong> Kuan-Yi Lee </strong>, Da-Shan Liu, Hung-Yi Lee",
        "conference": "Submitted to 2026 ICLR",
        "paper_link": "https://arxiv.org/abs/2504.07053",
        "code_link": "https://github.com/mtkresearch/TASTE-SpokenLM",
        "page_link": "https://mtkresearch.github.io/TASTE-SpokenLM.github.io/",
        "abstract": "Submitted to ICLR 2026; a innovative paradigm which aligns speech tokens with corresponding text during tokenization."
      },
      {
        "title": "AEGIS: Automated Co-Evolutionary Framework for Guarding Prompt Injections Schema",
        "image": "images/AEGIS.png",
        "authors": "Ting-Chun Liu*, Ching-Yu Hsu*, <strong> Kuan-Yi Lee* </strong>, Chi-An Fu*, Hung-Yi. Lee",
        "conference": "Submitted to ACL Rolling Review",
        "paper_link": "https://arxiv.org/abs/2509.00088",
        "code_link": "",
        "page_link": "",
        "abstract": "An automated co-evolutionary framework to guard prompt-injection schemas. AEGIS consistently improves bothattack and defense prompts over successive iterations, achieving SOTA robustness against real-world injection attempts while preserving utility on benign inputs"
      },      
      {
        "title": "Adaptive Vector Steering: A Training-free, Layer-wise Intervention For Hallucination Mitigation In Large Audio and Multimodal Models",
        "image": "images/AVS.png",
        "authors": "Tsun-En, Lin, <strong> Kuan-Yi Lee </strong>, Hung-Yi, Lee",
        "conference": "Submitted to ICASSP 2026",
        "paper_link": "",
        "code_link": "",
        "page_link": "",
        "abstract": "A training-free, layer-wise vector steering intervention to mitigate hallucinations in large audio and multimodal models, achieving 8% relative improvement on Hallucination QA."
      },
      {
        "title": "Signatures of lower respiratory tract microbiome in children with severe community-acquired pneumonia using shotgun metagenomic sequencing",
        "image": "images/JMII.png",
        "authors": "T.Y. Yen, C. Hsu, N.C. Lee, C.S. Wu, H. Wang, <strong> K.-Y. Lee </strong>, C.-R. Lin, C.-Y. Lu, M.-L. Tsai, T.-Y. Liu, C. Lin, C.-Y. Chen, L.-Y. Chang, F. Lai, L.-M. Huang",
        "conference": "Journal of Microbiology, Immunology and Infection, Volume 58, Issue 1, February 2025, Pages 86-93",
        "paper_link":"https://scholar.google.com/citations?view_op=view_citation&hl=zh-TW&user=dIA6CAgAAAAJ&citation_for_view=dIA6CAgAAAAJ:u5HHmVD_uO8C",
        "code_link": "",
        "abstract":"conducted a prospective cohort study to recruit children under 18 who required admission to an intensive care unit for community-acquired pneumonia between December 2019 and February 2022."
      }
    ]
    ,"exp_list": [
      {
        "title": "ML Research Scientist Intern,  <a href='https://www.asus.com/'>ASUS</a>",
        "image": "images/ASUS.png",
        "date": "Jun. 2025 – Present",
        "advisor": "Advised by <a href='https://speech.ee.ntu.edu.tw/~hylee/index.php'>Prof. Hung-Yi Lee</a> and <a href='https://scholar.google.com/scholar?q=Dau-Cheng+Lyu'>Dau-Cheng Lyu (Google Scholar)</a>",
        "intro": "Research on hallucination mitigation and tool-augmented audio-language models.",
        "details": [
          "Proposed a weighted adaptive steering vector to mitigate hallucination in large audio models under low-computation settings, achieving a 6% F1-score improvement.",
          "Developed the Audio-Maestro framework to enable audio-language models to autonomously use auto-generated tools, improving accuracy by up to 5% on MMAU with low computing resources."
        ]
      },
      {
        "title": "Deep Learning Engineer Intern,  <a href='https://www.mediatek.com/'>MediaTek Research</a>",
        "image": "images/MTK.png", 
        "date": "Oct. 2024 - May. 2025",
        "advisor": "Advised by <a href='https://speech.ee.ntu.edu.tw/~hylee/index.php'>Dr. Hung-Yi, Lee</a>",
        "intro": "Co-developed a speech-text aligned tokenizer and fine-tuned Llama-1B-TASTE-V0.",
        "details": [
          "Co-developed the first speech-text aligned tokenizer and fine-tuned Llama-1B-TASTE-V0, enabling speech integration in LLMs without degrading text performance.",
          "Optimized training pipelines by converting ONNX models to PyTorch and building a parallelized audio processing/inference architecture."
        ]
      },
      {
        "title": "AI Engineer Intern,  <a href='https://www.nxp.com/'>NXP Semiconductors</a> ",
        "image": "images/NXP.png",
        "date": "Jul. 2024 - Oct. 2024",
        "advisor": "Advised by  <a href='https://www.linkedin.com/in/dennis-wee-8b80165/'>Dennis Wee</a> and <a href='https://www.linkedin.com/in/li-fong-tseng-8318696/'>Li-Fong Tseng</a> ",
        "intro": "Prototyped an AWS-based LLM chat interface with Autogen Studio for product engineers.",
        "details": [
          "Prototyped an AWS-based LLM chat interface with Autogen Studio to streamline workflows for product engineers across Singapore and the USA.",
          "Enhanced on-device anomaly detection using RAG and multi-agent techniques, improving accuracy of 1B local models for wafer defect analysis."
        ]
      }
    ]
    ,"project_list": [
      {
        "title": "MultiLingual TTS (3rd Interspeech Challenge 2025)",
        "image": "",
        "abstract": "Developed a weighted fine-tuning approach for the Whisper model to recognize previously unseen languages, achieving 3rd place overall (1st in the dialect metric) at the Interspeech 2025 Challenge.",
        "github_link": "https://github.com/gary920209/MultiLingual-TTS-"
      },
      {
        "title": "Fine-tuning LLaVA for Autonomous Driving Scenarios",
        "image": "",
        "abstract": "Fine-tuned the LLaVA model using Low-Rank Adaptation (LoRA) with a SAM-based visual projector, boosting Image QA performance by 60% on complex autonomous driving scenes.",
        "github_link": "https://github.com/gary920209/LLAVA_on_AutonomousDriving"
      },
      {
        "title": "Data-Driven Business Metric Optimization",
        "image": "",
        "abstract": "Engineered new audit metrics for a co-working space startup by analyzing user feedback with an LLM pipeline, increasing the metric-to-NPS correlation from 0.1 to 0.48 and reducing user rating gaps by 31%."
      }
    ]
}
